In [1]:
import pandas as pd
import numpy as np

In [114]:
bike = pd.read_csv("dataset/bike.csv")
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1

In [115]:
bike.sample(n=2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
7846,2012-06-07 07:00:00,2,0,1,1,20.50,24.24,82,11.0014,20,506,526
5285,2011-12-14 07:00:00,4,0,1,1,11.48,15.91,75,0.0000,4,243,247

In [116]:
np.random.seed(3)
bike.sample(n=2)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
6198,2012-02-14 12:00:00,1,0,1,2,12.30,14.395,52,15.0013,10,162,172
8947,2012-08-15 04:00:00,3,0,1,1,26.24,28.790,83,7.0015,0,4,4

In [117]:
bike.sample(n=2, random_state=123)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
6495,2012-03-07 21:00:00,1,0,1,1,18.04,21.97,62,16.9979,11,177,188
7050,2012-04-12 03:00:00,2,0,1,1,13.12,15.15,61,16.9979,2,3,5

In [118]:
iris = pd.read_csv("dataset/iris_xlsx.csv")

In [119]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [120]:
iris.corr()

              Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Sepal.Length      1.000000    -0.117570      0.871754     0.817941
Sepal.Width      -0.117570     1.000000     -0.428440    -0.366126
Petal.Length      0.871754    -0.428440      1.000000     0.962865
Petal.Width       0.817941    -0.366126      0.962865     1.000000

In [121]:
iris.corr(method="pearson") #default: pearson

              Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Sepal.Length      1.000000    -0.117570      0.871754     0.817941
Sepal.Width      -0.117570     1.000000     -0.428440    -0.366126
Petal.Length      0.871754    -0.428440      1.000000     0.962865
Petal.Width       0.817941    -0.366126      0.962865     1.000000

In [122]:
iris.corr().round(2)

              Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
Sepal.Length          1.00        -0.12          0.87         0.82
Sepal.Width          -0.12         1.00         -0.43        -0.37
Petal.Length          0.87        -0.43          1.00         0.96
Petal.Width           0.82        -0.37          0.96         1.00

In [38]:
from scipy.stats import pearsonr #pearosn 상관분석
from scipy.stats import kendalltau #kendall 상관분석
from scipy.stats import spearmanr #spearman 상관분석

In [39]:
df = pd.DataFrame([["A", 3], ["C", 1], ["B", 2]], columns=["class", "value"])
df

  class  value
0     A      3
1     C      1
2     B      2

In [40]:
df.sort_values(by="class")

  class  value
0     A      3
2     B      2
1     C      1

In [41]:
df.sort_values(by="class", ascending=False)

  class  value
1     C      1
2     B      2
0     A      3

In [123]:
df_1 = bike.head()
df_2 = bike.tail()
df_bind = pd.concat([df_1, df_2])
df_bind.shape

(10, 12)

In [124]:
df_bind

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0000,3,13,16
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0000,8,32,40
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0000,5,27,32
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0000,3,10,13
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0000,0,1,1
10881,2012-12-19 19:00:00,4,0,1,1,15.58,19.695,50,26.0027,7,329,336
10882,2012-12-19 20:00:00,4,0,1,1,14.76,17.425,57,15.0013,10,231,241
10883,2012-12-19 21:00:00,4,0,1,1,13.94,15.910,61,15.0013,4,164,168
10884,2012-12-19 22:00:00,4,0,1,1,13.94,17.425,61,6.0032,12,117,129
10885,2012-12-19 23:00:00,4,0,1,1,13.12,16.665,66,8.9981,4,84,88

In [125]:
pd.concat([df_1, df_2], axis = 1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,...,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1.0,0.0,0.0,1.0,9.84,14.395,81.0,0.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2011-01-01 01:00:00,1.0,0.0,0.0,1.0,9.02,13.635,80.0,0.0,8.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2011-01-01 02:00:00,1.0,0.0,0.0,1.0,9.02,13.635,80.0,0.0,5.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2011-01-01 03:00:00,1.0,0.0,0.0,1.0,9.84,14.395,75.0,0.0,3.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2011-01-01 04:00:00,1.0,0.0,0.0,1.0,9.84,14.395,75.0,0.0,0.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10881,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,15.58,19.695,50.0,26.0027,7.0,329.0,336.0
10882,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,14.76,17.425,57.0,15.0013,10.0,231.0,241.0
10883,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.94,15.910,61.0,15.0013,4.0,164.0,168.0
10884,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.94,17.425,61.0,6.0032,12.0,117.0,129.0
10885,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.0,1.0,1.0,13.12,16.665,66.0,8.9981,4.0,84.0,88.0

In [126]:
pd.concat([df_1, df_2.reset_index(drop=True)], axis = 1)

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,...,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,...,0,1,1,15.58,19.695,50,26.0027,7,329,336
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,...,0,1,1,14.76,17.425,57,15.0013,10,231,241
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,...,0,1,1,13.94,15.910,61,15.0013,4,164,168
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,...,0,1,1,13.94,17.425,61,6.0032,12,117,129
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,...,0,1,1,13.12,16.665,66,8.9981,4,84,88

In [127]:
# bike["season_1"] = np.where(bike["season"] == 1, 1, 0)
bike["season_1"] = (bike["season"] == 1).astype(int)
bike["season_1"]

0        1
1        1
2        1
3        1
4        1
        ..
10881    0
10882    0
10883    0
10884    0
10885    0
Name: season_1, Length: 10886, dtype: int64

In [128]:
df_dum = pd.get_dummies(bike.iloc[:, 1:], columns=["season"])
df_dum.loc[1322:1323]

,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_1,season_1,season_2,season_3,season_4
1322,0,0,1,15.58,19.695,40,19.9995,13,37,50,1,1,0,0,0
1323,0,1,3,10.66,12.880,100,11.0014,0,6,6,0,0,1,0,0

In [129]:
df_dum = pd.get_dummies(bike.iloc[:, 1:], columns=["season"], drop_first=True)
df_dum.loc[1322:1323]

,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_1,season_2,season_3,season_4
1322,0,0,1,15.58,19.695,40,19.9995,13,37,50,1,0,0,0
1323,0,1,3,10.66,12.880,100,11.0014,0,6,6,0,1,0,0

In [130]:
bike["season"].unique()

array([1, 2, 3, 4])

In [131]:
bike["season"].value_counts()

4    2734
2    2733
3    2733
1    2686
Name: season, dtype: int64

In [132]:
pd.crosstab(bike["season"], bike["holiday"])

holiday     0   1
season
1        2615  71
2        2685  48
3        2637  96
4        2638  96

In [73]:
dia = pd.read_csv("dataset/diamonds.csv")

In [74]:
dia.cut.value_counts()

Ideal        21551
Premium      13791
Very Good    12082
Good          4906
Fair          1610
Name: cut, dtype: int64

In [76]:
dia.cut.value_counts(normalize=True)

Ideal        0.399537
Premium      0.255673
Very Good    0.223990
Good         0.090953
Fair         0.029848
Name: cut, dtype: float64

In [78]:
dia.cut.value_counts(normalize=True).reset_index().round(2)

       index   cut
0      Ideal  0.40
1    Premium  0.26
2  Very Good  0.22
3       Good  0.09
4       Fair  0.03

In [79]:
pd.crosstab(dia["cut"], dia['color'])

color         D     E     F     G     H     I    J
cut
Fair        163   224   312   314   303   175  119
Good        662   933   909   871   702   522  307
Ideal      2834  3903  3826  4884  3115  2093  896
Premium    1603  2337  2331  2924  2360  1428  808
Very Good  1513  2400  2164  2299  1824  1204  678

In [80]:
pd.crosstab(dia["cut"], dia['color'], normalize=True)

color,D,E,F,G,H,I,J
cut,,,,,,,
Fair,0.003022,0.004153,0.005784,0.005821,0.005617,0.003244,0.002206
Good,0.012273,0.017297,0.016852,0.016148,0.013014,0.009677,0.005692
Ideal,0.052540,0.072358,0.070931,0.090545,0.057749,0.038802,0.016611
Premium,0.029718,0.043326,0.043215,0.054208,0.043752,0.026474,0.014980
Very Good,0.028050,0.044494,0.040119,0.042621,0.033815,0.022321,0.012570

In [81]:
pd.crosstab(dia["cut"], dia['color'], normalize=0)

color,D,E,F,G,H,I,J
cut,,,,,,,
Fair,0.101242,0.139130,0.193789,0.195031,0.188199,0.108696,0.073913
Good,0.134937,0.190175,0.185283,0.177538,0.143090,0.106400,0.062576
Ideal,0.131502,0.181105,0.177532,0.226625,0.144541,0.097118,0.041576
Premium,0.116235,0.169458,0.169023,0.212022,0.171126,0.103546,0.058589
Very Good,0.125228,0.198643,0.179109,0.190283,0.150968,0.099652,0.056117

In [82]:
pd.crosstab(dia["cut"], dia['color'], normalize=1)

color,D,E,F,G,H,I,J
cut,,,,,,,
Fair,0.024059,0.022864,0.032698,0.027807,0.036488,0.032276,0.042379
Good,0.097712,0.095233,0.095263,0.077134,0.084538,0.096274,0.109330
Ideal,0.418303,0.398387,0.400964,0.432519,0.375120,0.386020,0.319088
Premium,0.236605,0.238542,0.244288,0.258944,0.284200,0.263371,0.287749
Very Good,0.223321,0.244973,0.226787,0.203595,0.219653,0.222058,0.241453

In [84]:
dia_sub = dia.loc[:5, "x":]
dia_sub["obs"] = dia_sub.index
dia_sub

      x     y     z  obs
0  3.95  3.98  2.43    0
1  3.89  3.84  2.31    1
2  4.05  4.07  2.31    2
3  4.20  4.23  2.63    3
4  4.34  4.35  2.75    4
5  3.94  3.96  2.48    5

In [87]:
dia_sub.melt(id_vars="obs").head()

   obs variable  value
0    0        x   3.95
1    1        x   3.89
2    2        x   4.05
3    3        x   4.20
4    4        x   4.34

In [88]:
elec = pd.read_csv("dataset/elec_load.csv")
elec.head()

,YEAR,MONTH,DAY,X1HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,...,X15HR,X16HR,X17HR,X18HR,X19HR,X20HR,X21HR,X22HR,X23HR,X24HR
0,2008,1,1,39638,37682,35801,34154,33068,32529,31982,...,28147,28313,28683,30921,32879,33038,34031,34684,37444,38160
1,2008,1,2,37425,35239,33568,32171,31616,31725,32575,...,38213,38132,38399,39796,40810,39980,40084,39630,42008,42150
2,2008,1,3,40757,38681,37047,35732,34912,34922,35563,...,37355,36776,36478,37221,38481,38074,38606,38596,41439,41521
3,2008,1,4,40220,38434,36832,35521,34728,34436,34299,...,32095,31985,32396,34213,36238,36424,37282,37525,40055,40232
4,2008,1,5,39056,37208,35688,34481,33979,34261,35315,...,42113,41734,42063,43370,44454,43408,43052,42300,44603,44500

In [97]:
elec_melt = elec.melt(id_vars=["YEAR", "MONTH", "DAY"])
elec_melt.head()

   YEAR  MONTH  DAY variable  value
0  2008      1    1     X1HR  39638
1  2008      1    2     X1HR  37425
2  2008      1    3     X1HR  40757
3  2008      1    4     X1HR  40220
4  2008      1    5     X1HR  39056

In [113]:
# elec_pivot = elec_melt.pivot_table(index=["YEAR", "MONTH", "DAY"], columns="variable", values="value").reset_index()
elec_pivot = elec_melt.pivot_table(index="YEAR", columns="variable", values="value", aggfunc="mean").reset_index()
elec_pivot

variable,YEAR,X10HR,X11HR,X12HR,X13HR,X14HR,X15HR,X16HR,X17HR,X18HR,...,X23HR,X24HR,X2HR,X3HR,X4HR,X5HR,X6HR,X7HR,X8HR,X9HR
0,2008,39788.428962,40600.827869,40916.469945,38637.887978,39986.907104,40649.508197,40379.448087,40368.475410,40334.076503,...,42047.663934,40641.650273,35903.412568,34542.415301,33593.213115,33285.382514,33508.587432,34417.360656,35697.885246,37405.142077
1,2009,42610.646575,43469.205479,43864.104110,41497.271233,42838.586301,43489.690411,43183.854795,43172.652055,43097.268493,...,44786.745205,43363.452055,38431.906849,37067.213699,36132.523288,35824.621918,36072.884932,36981.972603,38271.712329,40036.972603
2,2010,44840.276712,45726.734247,46006.947945,43512.495890,45076.860274,45684.273973,45366.600000,45292.065753,45274.156164,...,46785.200000,45320.860274,39830.238356,38564.997260,37802.673973,37783.013699,38323.789041,39382.684932,40501.046575,42355.693151
3,2011,47613.717808,48578.904110,48764.164384,46159.583562,47817.868493,48423.112329,48092.153425,48077.756164,48045.953425,...,48516.167123,47465.736986,41783.241096,40566.136986,39953.271233,40156.326027,40932.449315,42172.128767,43281.446575,45479.619178
4,2012,49714.696721,50773.576503,50964.663934,48267.420765,50048.765027,50638.901639,50283.448087,50262.562842,50172.021858,...,49692.076503,49027.016393,43206.423497,42021.836066,41449.573770,41729.338798,42638.183060,44117.726776,45325.953552,47698.188525
5,2013,51368.298630,52421.939726,52532.323288,49768.786301,51638.747945,52284.465753,51907.230137,51849.564384,51757.169863,...,50699.142466,50176.205479,44128.715068,42921.975342,42383.473973,42746.476712,43803.986301,45488.580822,46798.430137,49348.701370
6,2014,56277.783562,57365.693151,57473.049315,54515.805479,56471.068493,57123.800000,56727.235616,56763.145205,56682.583562,...,55083.049315,54484.663014,48187.731507,46928.221918,46370.345205,46728.906849,47756.463014,49487.378082,51053.912329,54061.989041
7,2015,59055.873973,60020.224658,60026.528767,57006.676712,59046.832877,59694.147945,59275.679452,59335.153425,59113.690411,...,57274.410959,56669.778082,50544.235616,49286.364384,48737.684932,49089.756164,50179.641096,52026.471233,53747.526027,56899.720548
8,2016,60616.969945,61501.349727,61454.144809,58450.161202,60543.188525,61131.718579,60717.898907,60743.969945,60415.997268,...,58278.032787,57724.489071,51670.778689,50442.663934,49888.879781,50210.803279,51212.907104,53010.948087,54916.415301,58410.002732
9,2017,62120.693798,62868.577519,62797.116279,60075.104651,62121.007752,62673.771318,62213.251938,62194.953488,61703.693798,...,59126.089147,58237.259690,52253.232558,50967.383721,50403.972868,50670.496124,51568.717054,53473.174419,55730.282946,59634.186047

In [103]:
elec_melt.groupby(["YEAR", "variable"])["value"].mean().reset_index().head()

   YEAR variable         value
0  2008    X10HR  39788.428962
1  2008    X11HR  40600.827869
2  2008    X12HR  40916.469945
3  2008    X13HR  38637.887978
4  2008    X14HR  39986.907104

In [137]:
bike["datetime"] = pd.to_datetime(bike.datetime)
bike["wday"] = bike.datetime.dt.dayofweek
bike["month"] = bike.datetime.dt.month
bike["hour"] = bike.datetime.dt.hour
bike.head()

,datetime,season,holiday,workingday,weather,temp,atemp,humidity,windspeed,casual,registered,count,season_1,wday,month,hour
0,2011-01-01 00:00:00,1,0,0,1,9.84,14.395,81,0.0,3,13,16,1,5,1,0
1,2011-01-01 01:00:00,1,0,0,1,9.02,13.635,80,0.0,8,32,40,1,5,1,1
2,2011-01-01 02:00:00,1,0,0,1,9.02,13.635,80,0.0,5,27,32,1,5,1,2
3,2011-01-01 03:00:00,1,0,0,1,9.84,14.395,75,0.0,3,10,13,1,5,1,3
4,2011-01-01 04:00:00,1,0,0,1,9.84,14.395,75,0.0,0,1,1,1,5,1,4